app/controllers/home_controller.rb

  def get_words
    predicted_word = PredictionWord.find_by_t_word(params[:word].split(" "))
    unless predicted_word.blank?
---
SELECT `prediction_words`.* FROM `prediction_words` WHERE `prediction_words`.`t_word` IN (x'44656570616b', x'7374617973', x'696e', x'746865') LIMIT 1
SELECT `prediction_words`.* FROM `prediction_words` LIMIT 1